app/Controllers/carrito_controller.php

SELECT *
FROM `productos`
ORDER BY `id` DESC
---
    public function catalogo(){
        $productoModel= new Producto_Model();
        $data['producto'] = $productoModel->ordenBy('id','DESC')->findAll();